{
  "software-engineer": "Softwareingenieur",
  "my-name-is": "Hey! 👋 Mein Name ist",
  "intro-paragraph-1": "Hallo, Welt! Mein Name ist <bold>Vlad</bold> und ich bin ein Full-Stack <bold>Softwareingenieur</bold>, der in Polen lebt und gerne neue Dinge für Web und Mobile entwickelt sowie eine Leidenschaft für Problemlösungen hat. Mit dem erfolgreichen Abschluss meines Bachelorstudiums an der Technischen Universität Košice verfüge ich über ein tiefgreifendes Verständnis der grundlegenden Prinzipien der Informatik.",
  "intro-paragraph-2": "Während meiner Zeit als Frontend-Entwickler hatte ich die unschätzbare Gelegenheit, meine Fähigkeiten im Erstellen visuell ansprechender und nutzerzentrierter Oberflächen zu verfeinern. Diese Phase ermöglichte nicht nur eine reibungslose Zusammenarbeit mit diversen, funktionsübergreifenden Teams, sondern gewährte mir auch tiefe Einblicke in die komplexe Kunst der Benutzererfahrung.",
  "intro-paragraph-3": "Zögern Sie nicht, mich über die angegebenen Kontaktinformationen zu erreichen. Vielen Dank für Ihren Besuch, und ich freue mich auf die Möglichkeit, gemeinsam Ihre technologischen Visionen zum Leben zu erwecken.",
  "get-in-touch": "Kontakt aufnehmen",
  "first-name": "Vorname",
  "last-name": "Nachname",
  "email": "E-Mail",
  "subject": "Betreff",
  "your-message": "Ihre Nachricht",
  "send-message": "Nachricht senden",
  "message-sent-success": "Nachricht erfolgreich gesendet!",
  "message-sent-failure": "Nachricht konnte nicht gesendet werden.",
  "first-name-required": "Vorname ist erforderlich.",
  "email-required": "E-Mail ist erforderlich.",
  "subject-required": "Betreff ist erforderlich.",
  "message-required": "Nachricht ist erforderlich.",
  "visit-website": "Website besuchen",
  "go-to-repo": "Zum Repository",
  "view-site": "Seite ansehen!",
  "contact-me": "Kontaktieren Sie mich",
  "download-cv": "Lebenslauf herunterladen",
  "hero-paragraph": "Ich bin ein <bold>Softwareingenieur</bold>, der die Arbeit erledigt. Derzeit konzentriere ich mich auf <skill>Full-Stack</skill>-Web- und Mobile-Entwicklung."
}
