{
  "software-engineer": "Software Engineer",
  "my-name-is": "Hey!👋 My name is",
  "made-with": "Made with",
  "for": "for",
  "go-to-repo": "Go to repo",
  "view-site": "View site!",
  "download-cv": "Download CV",
  "skills": "Skills",
  "hero-paragraph": "I'm a <bold>Software Engineer</bold> who gets the job done. Currently, I'm focused on <skill>Full-stack</skill> Web and Mobile Development.",
  "nav": {
    "about": "0. About",
    "experience": "1. Experience",
    "projects": "2. Projects"
  },
  "about-me": {
    "title": "About me",
    "intro-paragraph-1": "Hello, World! My name is <bold>Vlad</bold> and I am a Full-Stack <bold>Software Engineer</bold> based in Poland, who enjoys creating new things for the web and mobile and has a passion for problem solving. With the successful completion of my Bachelor’s Degree at the Technical University of Košice, my educational background equips me with a profound understanding of fundamental computer science principles.",
    "intro-paragraph-2": "During my tenure as a frontend developer, I had the invaluable opportunity to refine my expertise in crafting visually captivating and user-centric interfaces. This chapter not only facilitated seamless collaboration with diverse, cross-functional teams but also granted me a profound insight into the intricate artistry of user experience.",
    "intro-paragraph-3": "Feel free to reach out via the provided contact information. Thank you for visiting, and I look forward to the opportunity of working together to bring your technological visions to life."
  },
  "projects": {
    "title": "My Latest Projects",
    "summary": "A collection of personal projects I’ve built or am currently working on.",
    "toki": "A web application designed to help users track issues efficiently. It allows users to log issues, update their status, and store the necessary details.",
    "pokedex": "A Pokédex web application built with Vue.js that allows users to browse, search, and view detailed information about various Pokémon, including their stats and abilities.",
    "graphs": "Single page React application that allows users to create graph structures, export the canvas as a png image and check the correctness of coloring."
  },
  "experience": {
    "title": "Professional Experience",
    "summary": {
      "experience_summary": "1.5+ years of professional development experience.",
      "education": "I started my career learning Software Engineering concepts while studying at the Technical University of Kosice.",
      "promiseo": "My first job was a part-time frontend role at Promiseo, a marketing agency in Košice. I was responsible for developing new pages for different clients.",
      "boataround": "After that, I joined Boataround, a yacht rental company in Bratislava. There, I worked on adding new features, improving existing ones, and helped build a brand new web app for yacht owners using React and TypeScript."
    },
    "boataround": {
      "description": "Created and optimized components and dynamic pages for a yacht rental web platform using Vue.js, React, and Node.js, and optimized MongoDB queries, reducing page load time. Cooperated with various departments to implement solutions for a wide range of features. Conducted code reviews and resolved critical UI/UX bugs, improving user experience. Implemented several A/B tests to evaluate and refine website features, improving conversion rates and increasing user engagement.",
      "date": "September 2023 - June 2024",
      "location": "Bratislava, Slovakia",
      "position": "Software Engineer"
    },
    "freelance": {
      "description": "Revamped the frontend UI of a time conversion website by migrating from Bootstrap to Bulma CSS, improving code maintainability and reducing CSS bloat. Delivered full-stack solutions for clients using React, Vue.js, TypeScript, and Python’s Flask framework, tailoring implementations to meet unique business requirements.",
      "date": "July 2023 - November 2024",
      "location": "Remote",
      "position": "Software Engineer"
    },
    "promiseo": {
      "description": "Built visually appealing web interfaces using HTML, CSS/Sass, JavaScript, and Vue.js. Collaborated closely with design and product teams to transform wireframes and mockups into fully functional web pages for various small and medium-sized local businesses.",
      "date": "February 2023 - May 2023",
      "location": "Košice, Slovakia",
      "position": "Frontend Engineer"
    }
  }
}
